mtest> mtnew 10

mtest> mtnew 5 -a 512

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 2
* Free mem in last block: 51196
* Recycle list          : 
[281] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
ooooo

mtest> mtnew 5 -a 1024

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 4
* Free mem in last block: 8184
* Recycle list          : 
[281] = 1         [804] = 1         [292] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
oooooooooo

mtest> mtnew 5 -a 256

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 5
* Free mem in last block: 36848
* Recycle list          : 
[281] = 1         [804] = 1         [292] = 1         [ 36] = 1         

=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
ooooooooooooooo

mtest> mtdel -i 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 5
* Free mem in last block: 36848
* Recycle list          : 
[  0] = 1         [281] = 1         [804] = 1         [292] = 1         
[ 36] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooxoooooo
Array list ---
ooooooooooooooo

mtest> mtdel -i 4 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 5
* Free mem in last block: 36848
* Recycle list          : 
[  0] = 1         [512] = 1         [281] = 1         [804] = 1         
[292] = 1         [ 36] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooxoooooo
Array list ---
ooooxoooooooooo

mtest> mtdel -i 8 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 5
* Free mem in last block: 36848
* Recycle list          : 
[  0] = 1         [512] = 1         [1024] = 1         [281] = 1         
[804] = 1         [292] = 1         [ 36] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooxoooooo
Array list ---
ooooxoooxoooooo

mtest> mtdel -i 13 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 5
* Free mem in last block: 36848
* Recycle list          : 
[  0] = 1         [512] = 1         [1024] = 1         [256] = 1         
[281] = 1         [804] = 1         [292] = 1         [ 36] = 1         

=========================================
=             class MemTest             =
=========================================
Object list ---
oooxoooooo
Array list ---
ooooxoooxooooxo

mtest> mtr 120

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 120 Bytes
* Number of blocks      : 1
* Free mem in last block: 120
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---


mtest> q -f

